{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 250], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_1_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "dtype": "float32", "batch_input_shape": [null, 250], "input_dim": 194200, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 250}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.004999999888241291, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of38.bin", "group1-shard2of38.bin", "group1-shard3of38.bin", "group1-shard4of38.bin", "group1-shard5of38.bin", "group1-shard6of38.bin", "group1-shard7of38.bin", "group1-shard8of38.bin", "group1-shard9of38.bin", "group1-shard10of38.bin", "group1-shard11of38.bin", "group1-shard12of38.bin", "group1-shard13of38.bin", "group1-shard14of38.bin", "group1-shard15of38.bin", "group1-shard16of38.bin", "group1-shard17of38.bin", "group1-shard18of38.bin", "group1-shard19of38.bin", "group1-shard20of38.bin", "group1-shard21of38.bin", "group1-shard22of38.bin", "group1-shard23of38.bin", "group1-shard24of38.bin", "group1-shard25of38.bin", "group1-shard26of38.bin", "group1-shard27of38.bin", "group1-shard28of38.bin", "group1-shard29of38.bin", "group1-shard30of38.bin", "group1-shard31of38.bin", "group1-shard32of38.bin", "group1-shard33of38.bin", "group1-shard34of38.bin", "group1-shard35of38.bin", "group1-shard36of38.bin", "group1-shard37of38.bin", "group1-shard38of38.bin"], "weights": [{"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel", "shape": [200, 256], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel", "shape": [200, 256], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [194200, 200], "dtype": "float32"}]}]}